#Вывести на экран числа от -N до N
n = int(input('Введите число: '))
m = -n
while(m<=n):
    print(m, end=' ')
    m+=1